Revit 2027 API
BuiltInFailures.FabricAreaFailures Class
 Failures related to fabric area elements.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.FabricAreaFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class FabricAreaFailures
Public NotInheritable Class FabricAreaFailures
public ref class FabricAreaFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FabricAreaFailures = class end
The BuiltInFailures.FabricAreaFailures type exposes the following members.
Properties
Name | Description
FabricAreaLapSplicesIncorrect |  Fabric Area lap splice is incorrect.
FabricAreaOutSideOfHost |  Fabric Area is sketched completely outside of its host.
Top
See Also
Reference
Autodesk.Revit.DB Namespace